perf-scripts/reports/ddos/2020-03-14T14:16:22.075060-get_comments-n2500-c100.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com (be patient)


Server Software:        
Server Hostname:        a7ac0b2a18e3e4d5bb07861ca733b7c2-82784151.eu-central-1.elb.amazonaws.com
Server Port:            80

Document Path:          /images/8ff88b5e-d1a0-431a-8cdd-1a82a1a9b1fb/comments?size=20
Document Length:        5161 bytes

Concurrency Level:      100
Time taken for tests:   15.473 seconds
Complete requests:      2500
Failed requests:        0
Total transferred:      13262500 bytes
HTML transferred:       12902500 bytes
Requests per second:    161.57 [#/sec] (mean)
Time per request:       618.931 [ms] (mean)
Time per request:       6.189 [ms] (mean, across all concurrent requests)
Transfer rate:          837.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   3.7      1      32
Processing:    93  603 292.4    545    2063
Waiting:       92  597 291.1    540    2063
Total:         94  605 292.4    546    2063

Percentage of the requests served within a certain time (ms)
  50%    546
  66%    655
  75%    744
  80%    837
  90%   1008
  95%   1197
  98%   1386
  99%   1508
 100%   2063 (longest request)
